{
    "en": {
        "header": "Let’s get started with the tool.<br> Be attentive and read the text to understand how each component works.",
        "steps": [
            {
                "inFocus": "Lives",
                "title": "Lives (tries)",
                "description": "Here you can see your three lives,<br>which will go down by one if you make a mistake.<br><br>But do not worry, if you run out of lives, the track<br>will change and you will have your lives refilled.",
                "position": {
                    "x": 590,
                    "y": 33
                },
                "showBlur": true
            },
            {
                "inFocus": "Signature",
                "title": "Time signature",
                "description": "After you successfully choose the right number<br> of beats in a bar for the track, the time signature of <br>the track will appear in this window.",
                "position": {
                    "x": 549,
                    "y": 140
                },
                "showBlur": true
            },
            {
                "inFocus": "ProgressBar",
                "title": "Music progress bar",
                "description": "Here you can see the music progress bar.<br>It works just like any other one:<br>you can drag the playhead to the play<br>the track from the specific part you want.",
                "position": {
                    "x": 34,
                    "y": 403
                },
                "showBlur": true
            },
            {
                "inFocus": "Level",
                "title": "Play/pause button",
                "description": "You can probably guess what this does, right?<br>This button is for playing and pausing the track whenever needed.<br>Now, let’s click on it to start the track and start playing.",
                "position": {
                    "x": 34,
                    "y": 144
                },
                "showBlur": true,
                "hideNext": true
            },
            {
                "inFocus": "Beat",
                "title": "First correct dot",
                "description": "It seems like the time signature for this track is 4,<br>which means that there are X beats in one bar.<br>You will need to choose and click<br>on the first dot of each bar, like this one.<br>Click it to see what happens.",
                "position": {
                    "x": 219,
                    "y": 408
                },
                "hideBlur": true
            },
            {
                "description": "Great job! Green means that you chose the beat correctly.<br> Now go on and choose all the remaining correct beats",
                "position": {
                    "x": 219,
                    "y": 408
                },
                "staticCircles": true,
                "initCallForAction": true
            },
            {
                "description": "Cool! It’s correct just like the previous one.",
                "position": {
                    "x": 289,
                    "y": 408
                },
                "staticCircles": true,
                "initCallForAction": true
            },
            {
                "description": "Great! You chose all the beats for this track and now you are ready for<br> the next level. Click the arrow to go to the next level, <br>where everything works the same way, but you will need to do it on your own. ",
                "position": {
                    "x": 289,
                    "y": 439
                }
            }
        ],
        "callForAction": {
            "inFocus": "Beat",
            "description": "It seems like the next correct beat is this one. Let’s check by clicking.",
            "position": {
                "x": 289,
                "y": 408
            },
            "staticCircles": true
        },
        "firstFail": {
            "header": "Oops. This one is not correct and you lost one of your lives. But try again!",
            "inFocus": "Lives"
        },
        "trackFailed": {
            "header": "You made three mistakes, but do not worry. <br>You have your lives refilled and the track changed, so you can try again!",
            "inFocus": "Lives"
        },
        "done": "Amazing! It seems like you can count the time signature of any track now.<br> Now click the arrow to review the tracks of all the levels you just did."
    },
    "fr": {
        "header": "Commençons à découvrir l'outil. Sois attentif et lis les instructions<br> pour comprendre comment fonctionne chacun des composants.",
        "steps": [
            {
                "inFocus": "Lives",
                "title": "Vies (essais)",
                "description": "Ici, tu vois tes trois vies. <br>Si tu ne fais pas le bon choix,<br> le nombre de vies diminuera progressivement.<br><br> Mais ne t'inquiète pas,<br> si tu n'as plus de vies,<br> la piste changera et tu les gagneras de nouveau.",
                "position": {
                    "x": 590,
                    "y": 33
                },
                "showBlur": true
            },
            {
                "inFocus": "Signature",
                "title": "La mesure",
                "description": "Lorsque tu choisis le bon nombre de <br>beats dans la barre de piste, la mesure de la<br> piste apparaîtra dans cette fenêtre.",
                "position": {
                    "x": 549,
                    "y": 140
                },
                "showBlur": true
            },
            {
                "inFocus": "ProgressBar",
                "title": "Barre de progression de la musique",
                "description": "Ici, tu vois la barre de progression de la musique.<br> Elle fonctionne comme toutes les autres :<br> fais glisser le lecteur pour lire <br>la piste sur toute partie spécifique de ton choix.",
                "position": {
                    "x": 34,
                    "y": 403
                },
                "showBlur": true
            },
            {
                "inFocus": "Level",
                "title": "Bouton lecture/pause",
                "description": "Tu devines probablement à quoi ça sert, non ?<br> Ce bouton permet de lire et de mettre en pause la piste à tout moment.<br> Clique maintenant sur ce bouton pour commencer la lecture de la piste.",
                "position": {
                    "x": 34,
                    "y": 144
                },
                "showBlur": true,
                "hideNext": true
            },
            {
                "inFocus": "Beat",
                "title": "Premier point correct",
                "description": "Il semble que la mesure de cette piste soit 4. Cela signifie qu'il<br> y a X beats dans une mesure. Tu devras choisir et cliquer sur<br> le premier point de chaque mesure, comme celui-ci.<br> Clique dessus pour voir ce qui se passe.",
                "position": {
                    "x": 219,
                    "y": 408
                },
                "hideBlur": true
            },
            {
                "description": "Bon travail ! Le feu vert signifie que tu as sélectionné le bon beat.<br> Vas-y et trouve tous les autres beats corrects.",
                "position": {
                    "x": 219,
                    "y": 408
                },
                "staticCircles": true,
                "initCallForAction": true
            },
            {
                "description": "Génial ! C'est correct, tout comme le précédent.",
                "position": {
                    "x": 289,
                    "y": 408
                },
                "staticCircles": true,
                "initCallForAction": true
            },
            {
                "description": "Super ! Tu as choisi tous les beats pour cette piste et tu peux maintenant<br> passer au niveau suivant en cliquant sur la flèche.<br> Ici, tout fonctionne de la même manière, mais tu devras te débrouiller seul.",
                "position": {
                    "x": 289,
                    "y": 439
                }
            }
        ],
        "callForAction": {
            "inFocus": "Beat",
            "description": "Il semble que le bon beat suivant soit celui-ci.<br> Vérifions-le en cliquant.",
            "position": {
                "x": 289,
                "y": 408
            },
            "staticCircles": true
        },
        "firstFail": {
            "header": "Oups. Ce n'est pas correct et tu as perdu une de tes vies. Mais vas-y, essaie encore !",
            "inFocus": "Lives"
        },
        "trackFailed": {
            "header": "Tu n'as pas choisi le bon beat trois fois, mais ne t'inquiète pas.<br> Tes vies ont été renouvelées et la piste a été modifiée, alors tu peux réessayer !",
            "inFocus": "Lives"
        },
        "done": "Génial ! Il semble que tu puisses compter la mesure de toute piste.<br> Clique maintenant sur la flèche pour revoir les pistes de tous les niveaux que tu viens de passer."
    },
    "ru": {
        "header": "Давай начнём работу. Будь внимателен и читай текст,<br> чтобы понять, как работает каждый из компонентов.",
        "steps": [
            {
                "inFocus": "Lives",
                "title": "Жизни (попытки)",
                "description": "Вот три твоих жизни. Они будут <br>уменьшаться, если ты допустишь ошибку, <br>но не переживай - если потратишь все три,<br> то мы просто поменяем трек <br>и ты сможешь попробовать ещё раз.",
                "position": {
                    "x": 590,
                    "y": 33
                },
                "showBlur": true
            },
            {
                "inFocus": "Signature",
                "title": "Размер",
                "description": "После того, как ты правильно укажешь<br> число долей в такте трека,<br> его размер появится в этом окне.",
                "position": {
                    "x": 549,
                    "y": 140
                },
                "showBlur": true
            },
            {
                "inFocus": "ProgressBar",
                "title": "Индикатор воспроизведения музыки",
                "description": "Здесь находится полоса прогресса.<br> Она работает так же, как в любом<br> плеере - просто перетаскивай её<br> на нужный тебе отрезок трека. ",
                "position": {
                    "x": 34,
                    "y": 403
                },
                "showBlur": true
            },
            {
                "inFocus": "Level",
                "title": "Кнопка воспроизведения/паузы",
                "description": "Что делает эта кнопка ты, вероятно,<br> уже догадался, да? Она запускает<br> и ставит трек на паузу. Давай нажмём<br> на ней и запустим воспроизведение.",
                "position": {
                    "x": 34,
                    "y": 136
                },
                "showBlur": true,
                "hideNext": true
            },
            {
                "inFocus": "Beat",
                "title": "Первая правильная точка",
                "description": "Похоже, что размер этого трека - 4,<br> то есть, в одном его такте есть 4 долей.<br> Тебе нужно будет выбрать и нажать<br> на первую точку каждого такта, как этот.<br> Нажми на неё, чтобы проверить, что произойдёт.",
                "position": {
                    "x": 219,
                    "y": 408
                },
                "hideBlur": true
            },
            {
                "description": "Отличная работа! Зелёный цвет означает,<br> что ты выбрал долю корректно.<br> Теперь правильно выбери все остальные.",
                "position": {
                    "x": 219,
                    "y": 408
                },
                "staticCircles": true,
                "initCallForAction": true
            },
            {
                "description": "Круто! Она тоже правильная",
                "position": {
                    "x": 289,
                    "y": 408
                },
                "staticCircles": true,
                "initCallForAction": true
            },
            {
                "description": "Отлично. Правильно выбери все доли трека<br> и ты готов к следующему уровню.<br> Нажми на стрелочку, чтобы к нему перейти.<br> Всё работает точно так же,<br> но этот уровень тебе уже предстоит пройти самостоятельно.",
                "position": {
                    "x": 289,
                    "y": 414
                }
            }
        ],
        "callForAction": {
            "inFocus": "Beat",
            "description": "Похоже, что следующая правильная доля эта.<br> Давай проверим - нажимай на неё.",
            "position": {
                "x": 289,
                "y": 408
            },
            "staticCircles": true
        },
        "firstFail": {
            "header": "Ой. А вот эту ты выбрал неправильно и потерял одну из своих жизней.<br> Но не унывай и попробуй снова!",
            "inFocus": "Lives"
        },
        "trackFailed": {
            "header": "Ты допустил три ошибки, но не волнуйся.<br> Мы вернули тебе твои три жизни и поменяли трек,<br> чтобы ты мог попробовать ещё раз.",
            "inFocus": "Lives"
        },
        "done": "Восхитительно! Похоже, что ты теперь умеешь определять размер любого трека.<br> Нажми на стрелочку, чтобы ещё раз прослушать все треки, с которыми ты только что работал. "
    },
    "am": {
        "header": "Սկզբում արի ծանոթանանք չափի գործիքին:<br> Ուշադի՛ր կարդա տեքստը, որ հասկանաս, թե ինչպես է աշխատում գործիքի յուրաքանչյուր մաս:",
        "steps": [
            {
                "inFocus": "Lives",
                "title": "Կյանքեր",
                "description": "Այստեղ կարող ես տեսնել քո<br> երեք կյանքերը, որոնք ամեն<br> սխալիդ դեպքում կպակասեն մեկով:<br><br> Բայց մի՛ անհանգստացիր.<br> եթե բոլոր կյանքերդ կորցնես,<br> կփոխվի երաժշտությունն ու <br>նորից կունենաս երեք կյանք:",
                "position": {
                    "x": 590,
                    "y": 33
                },
                "showBlur": true
            },
            {
                "inFocus": "Signature",
                "title": "Չափ",
                "description": "Երաժշտության աուդիոգոտում<br> ճիշտ չափը գտնելուց հետո այս էջում<br> կհայտնվի երաժշտության չափը:",
                "position": {
                    "x": 549,
                    "y": 140
                },
                "showBlur": true
            },
            {
                "inFocus": "ProgressBar",
                "title": "Երաժշտության ընթացքի գոտի",
                "description": "Հիմա քո առաջ երաժշտության ընթացքի գոտին է:<br> Այն աշխատում է ցանկացած այլ գոտու նման.<br> ընդամենը պետք է տեղաշարժես<br> նվագարկչի գլխիկը քո ուզած հատվածի վրա,<br> ու երաժշտությունը կսկսի այդ հատվածից:",
                "position": {
                    "x": 34,
                    "y": 403
                },
                "showBlur": true
            },
            {
                "inFocus": "Level",
                "title": "Նվագարկելու/դադարեցնելու կոճակ",
                "description": "Այս կոճակի կիրառությունը պարզ է.<br> դրանով կարող ես ցանկացած պահի նվագարկել կամ<br> դադարեցնել երաժշտությունը:<br> Հիմա արի սեղմենք նվագարկել կոճակն ու լսենք: ",
                "position": {
                    "x": 34,
                    "y": 130
                },
                "showBlur": true,
                "hideNext": true
            },
            {
                "inFocus": "Beat",
                "title": "Առաջին ճիշտ հարված",
                "description": "Կարծես այս երաժշտության չափը 4 է:<br> նշանակում է, որ մեկ տակտում (bar) կան 4 հարվածներ (beats):<br> Դու պետք է ընտրես ու սեղմես յուրաքանչյուր տակտի<br> առաջին հարվածի շրջանակին, ինչպես այս օրինակում է:<br> Սեղմիր, որ տեսնես, թե ինչ տեղի կունենա: ",
                "position": {
                    "x": 219,
                    "y": 408
                },
                "hideBlur": true
            },
            {
                "description": "Ապրե՛ս: Կանաչ գույնը նշանակում է,<br> որ հարվածը ճիշտ ես ընտրել: Շարունակիր նույն<br> կերպ ու ընտրիր մնացած բոլոր ճիշտ հարվածները:",
                "position": {
                    "x": 219,
                    "y": 408
                },
                "staticCircles": true,
                "initCallForAction": true
            },
            {
                "description": "Գերազա՜նց: Այն, ինչպես նախորդը, ճիշտ ես ընտրել:",
                "position": {
                    "x": 289,
                    "y": 408
                },
                "staticCircles": true,
                "initCallForAction": true
            },
            {
                "description": "Սեղմիր սլաքի վրա` հաջորդ մակարդակ<br> անցնելու համար: Հաջորդ մակարդակում ամեն<br> ինչ անելու ես նույն ձև, բայց հուշումներ չեն լինելու:",
                "position": {
                    "x": 289,
                    "y": 439
                }
            }
        ],
        "callForAction": {
            "inFocus": "Beat",
            "description": "Կարծես թե հաջորդ ճիշտ հարվածն այս մեկն է:<br> Արի համոզվենք դրա վրա սեղմելով:",
            "position": {
                "x": 289,
                "y": 408
            },
            "staticCircles": true
        },
        "firstFail": {
            "header": "Ուուփս. այս մեկը սխալ է, ու դու կորցրեցիր<br> քո կյանքերից մեկը: Բայց ոչինչ, կրկի՛ն փորձիր:",
            "inFocus": "Lives"
        },
        "trackFailed": {
            "header": "Երեք սխալ ընտրություն ես արել,  բայց ոչինչ:<br> Նոր երաժշտության հետ ստացել ես երեք նոր կյանք ու կարող ես կրկին փորձել:",
            "inFocus": "Lives"
        },
        "done": "Գերազա՜նց. կարծես, թե սրանից հետո ցանկացած երաժշտության չափ հաշվելը<br> քո համար հեշտ գործ է լինելու: Հիմա սեղմիր սլաքի վրա<br> ու կտեսնես քո արդյունքները:"
    }
}